## load data

In [1]:
# import library
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# load excel
user_engagement = pd.read_csv("takehome_user_engagement.csv")
#user_engagement = pd.read_csv("takehome_users.csv")

In [3]:
user_engagement.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 207917 entries, 0 to 207916
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   time_stamp  207917 non-null  object
 1   user_id     207917 non-null  int64
 2   visited     207917 non-null  int64
dtypes: int64(2), object(1)
memory usage: 4.8+ MB

In [4]:
users = pd.read_csv("takehome_users.csv", encoding='latin-1')

In [5]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12000 entries, 0 to 11999
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   object_id                   12000 non-null  int64
 1   creation_time               12000 non-null  object
 2   name                        12000 non-null  object
 3   email                       12000 non-null  object
 4   creation_source             12000 non-null  object
 5   last_session_creation_time  8823 non-null   float64
 6   opted_in_to_mailing_list    12000 non-null  int64
 7   enabled_for_marketing_drip  12000 non-null  int64
 8   org_id                      12000 non-null  int64
 9   invited_by_user_id          6417 non-null   float64
dtypes: float64(2), int64(4), object(4)
memory usage: 937.6+ KB

In [6]:
user_engagement.head()

            time_stamp  user_id  visited
0  2014-04-22 03:53:30        1        1
1  2013-11-15 03:45:04        2        1
2  2013-11-29 03:45:04        2        1
3  2013-12-09 03:45:04        2        1
4  2013-12-25 03:45:04        2        1

In [7]:
users.head()

,object_id,creation_time,name,email,creation_source,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id
0,1,2014-04-22 03:53:30,Clausen August,AugustCClausen@yahoo.com,GUEST_INVITE,1.398139e+09,1,0,11,10803.0
1,2,2013-11-15 03:45:04,Poole Matthew,MatthewPoole@gustr.com,ORG_INVITE,1.396238e+09,0,0,1,316.0
2,3,2013-03-19 23:14:52,Bottrill Mitchell,MitchellBottrill@gustr.com,ORG_INVITE,1.363735e+09,0,0,94,1525.0
3,4,2013-05-21 08:09:28,Clausen Nicklas,NicklasSClausen@yahoo.com,GUEST_INVITE,1.369210e+09,0,0,1,5151.0
4,5,2013-01-17 10:14:20,Raw Grace,GraceRaw@yahoo.com,GUEST_INVITE,1.358850e+09,0,0,193,5240.0

## arrange dataset

In [33]:
user_engagement['user_id'] = user_engagement['user_id'].astype(object)

## treat missing values

In [8]:
users['last_session_creation_time'].fillna(value = users['last_session_creation_time'].mean(),
          inplace = True)

In [9]:
users['invited_by_user_id'].fillna(value = 'NA',
          inplace = True)

In [10]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12000 entries, 0 to 11999
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   object_id                   12000 non-null  int64
 1   creation_time               12000 non-null  object
 2   name                        12000 non-null  object
 3   email                       12000 non-null  object
 4   creation_source             12000 non-null  object
 5   last_session_creation_time  12000 non-null  float64
 6   opted_in_to_mailing_list    12000 non-null  int64
 7   enabled_for_marketing_drip  12000 non-null  int64
 8   org_id                      12000 non-null  int64
 9   invited_by_user_id          12000 non-null  object
dtypes: float64(1), int64(4), object(5)
memory usage: 937.6+ KB

## EDA

### Define adopted user

In [22]:
# define time_stamp as new index
user_engagement = user_engagement.set_index('time_stamp')
user_engagement.index = pd.to_datetime(user_engagement.index)

KeyError: "None of ['time_stamp'] are in the columns"

In [24]:
user_engagement.head()

                     user_id  visited
time_stamp
2014-04-22 03:53:30        1        1
2013-11-15 03:45:04        2        1
2013-11-29 03:45:04        2        1
2013-12-09 03:45:04        2        1
2013-12-25 03:45:04        2        1

In [171]:
# sort by user_id
user_engagement = user_engagement.sort_values('user_id')

In [172]:
user_engagement.head(10)

                    user_id  visited
time_stamp
2014-04-22 03:53:30       1        1
2014-02-09 03:45:04       2        1
2013-11-29 03:45:04       2        1
2014-03-31 03:45:04       2        1
2014-02-03 03:45:04       2        1
2013-11-15 03:45:04       2        1
2013-12-25 03:45:04       2        1
2014-03-13 03:45:04       2        1
2014-02-08 03:45:04       2        1
2014-03-09 03:45:04       2        1

In [173]:
# count the user_id and crerate new df 
user_id_count = user_engagement['user_id'].value_counts()

In [174]:
user_id_count = user_id_count.to_frame()
user_id_count = user_id_count.reset_index()

user_id_count.columns = user_id_count.columns.str.replace('user_id', 'counts')
user_id_count.columns = user_id_count.columns.str.replace('index', 'user_id')

In [175]:
user_id_count

      user_id  counts
0        3623     606
1         906     600
2        1811     593
3        7590     590
4        8068     585
...       ...     ...
8818     4699       1
8819     4698       1
8820     4697       1
8821     4696       1
8822    12000       1

[8823 rows x 2 columns]

In [176]:
# define new column status and Temporarily input as NA
user_id_count['status'] = 'NA'

In [177]:
user_id_count

      user_id  counts status
0        3623     606     NA
1         906     600     NA
2        1811     593     NA
3        7590     590     NA
4        8068     585     NA
...       ...     ...    ...
8818     4699       1     NA
8819     4698       1     NA
8820     4697       1     NA
8821     4696       1     NA
8822    12000       1     NA

[8823 rows x 3 columns]

**time stamp is full 2 years. I think defining adopted user should be mean value of counts, not a user who has logged into the product on three separate days in at least one seven day period**

In [187]:
user_id_count.counts.mean()

23.565340587101893

In [188]:
# if counts is less than 24, define status as "Not Adopted"
for i in range(len(user_id_count)):
    #print(i)
    if user_id_count['counts'][i] < 24:
#        print(user_id_count['counts'][i])
        user_id_count['status'][i] = 'Not Adopted'
#        #print(user_id_count['status'][i])

/var/folders/3p/j9v4cftj6bv03_rdsgtmknsr0000gn/T/ipykernel_5124/2528482272.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  user_id_count['status'][i] = 'Not Adopted'

In [189]:
user_id_count.tail(7000)

      user_id  counts       status
1823      946       5  Not Adopted
1824     6523       5  Not Adopted
1825     9162       5  Not Adopted
1826     9934       4  Not Adopted
1827    11476       4  Not Adopted
...       ...     ...          ...
8818     4699       1  Not Adopted
8819     4698       1  Not Adopted
8820     4697       1  Not Adopted
8821     4696       1  Not Adopted
8822    12000       1  Not Adopted

[7000 rows x 3 columns]

In [186]:
user_engagement.sort_index()

                    user_id  visited
time_stamp
2012-05-31 08:20:06   10012        1
2012-05-31 15:47:36    3428        1
2012-05-31 17:19:37    9899        1
2012-05-31 21:58:33    1693        1
2012-06-01 00:17:30    6102        1
...                     ...      ...
2014-06-04 23:32:13    4625        1
2014-06-04 23:34:04    9325        1
2014-06-04 23:46:31    9558        1
2014-06-04 23:56:26     341        1
2014-06-06 14:58:50    4051        1

[207917 rows x 2 columns]

In [19]:
new_ue = user_engagement['visited'].resample('7D').sum()

In [20]:
new_ue.info()

<class 'pandas.core.series.Series'>
DatetimeIndex: 106 entries, 2012-05-31 to 2014-06-05
Freq: 7D
Series name: visited
Non-Null Count  Dtype
--------------  -----
106 non-null    int64
dtypes: int64(1)
memory usage: 1.7 KB

In [21]:
new_ue.head()

time_stamp
2012-05-31     57
2012-06-07     82
2012-06-14     95
2012-06-21    122
2012-06-28    113
Freq: 7D, Name: visited, dtype: int64